---
kind: type
id: T:Autodesk.Revit.DB.Analysis.SystemsAnalysisReportStyle
source: html/7c35982e-e55c-7d6e-89a9-d4078f92d6a5.htm
---
# Autodesk.Revit.DB.Analysis.SystemsAnalysisReportStyle

The report style of systems analysis.

## Syntax (C#)
```csharp
public enum SystemsAnalysisReportStyle
```